Neuroquila-n8fall/odroid-carpc-esp32/src/main.cpp
  CAN_frame_t rx_frame;
  



  // receive next CAN frame from queue
  if (xQueueReceive(CAN_cfg.rx_queue, &rx_frame, 3 * portTICK_PERIOD_MS) == pdTRUE)
  {

    // Buffer in data kopieren.
    byte i = rx_frame.FIR.B.DLC;
    while (i--)
      *(frame.data + i) = *(rx_frame.data.u8 + i);

    frame.len = rx_frame.FIR.B.DLC;
    frame.rxId = rx_frame.MsgID;

    previousCanMsgTimestamp = currentMillis;
    canbusEnabled = true;

    // Normalbetrieb
    if (hibernateActive)
    {
      // exitPowerSaving();
    }

    uint32_t canId = frame.rxId;

    //Alle CAN Nachrichten ausgeben, wenn debug aktiv.
    if (false)
    {
      printCanMsgCsv(canId, frame.data, frame.len);
    }

    switch (canId)
    {
    //MFL Knöpfe
    case MFL_BUTTON_ADDR:
    {
      onMflButtonPressed(frame);
      break;
    }
    //CAS: Schlüssel & Zündung
    case CAS_ADDR:
    {
      onCasMessageReceived(frame);
      break;
    }
    //CIC
    case CIC_ADDR:
    {
      break;
    }
    case IDRIVE_CTRL_INIT_RESPONSE_ADDR:
    {
      Serial.println("Controller Init OK");
      iDriveInitSuccess = true;
      break;
    }
    case IDRIVE_CTRL_STATUS_ADDR:
    {
      onIdriveStatusReceived(frame);
      break;
    }
    //CAS: Schlüssel Buttons
    case CAS_ZV_ADDR:
    {
      onCasCentralLockingReceived(frame);
      break;
    }
    //RLS Lichtsensorik
    case RLS_ADDR:
    {
      onRainLightSensorReceived(frame);
      break;
    }
    //Licht-, Solar- und Innenraumtemperatursensoren
    case IHKA_ADDR:
    {
      //Byte #0 ist der Solarsensor mittig auf dem Armaturenbrett
      /*  
          Solarsensor auf Byte 0: Startet bei 0, in Praller Sonne wurde 73 zuletzt gemeldet. Das ist definitiv der Solar Sensor!
          Dummerweise wir der Sensor manchmal vom Displaygehäuse verdeckt, je nachdem wie die Sonne einfällt. Macht halt das ganze
          Kontrukt teilweise unbruachbar...
      */
      //Byte 4 ist der IR Sensor im Klimabedienteil. Offenbar arbeitet dieser auch mit den Zonensensoren mit.
      break;
    }
    //Steuerung für Helligkeit der Armaturenbeleuchtung (Abblendlicht aktiv)
    case LM_DIM_ADDR:
    {
      //254 = AUS
      //Bereich: 0-253
      //Ab und zu wird 254 einfach so geschickt, wenn 0 vorher aktiv war...warum auch immer
      /*       Serial.print("Beleuchtung (Roh, Ctrl):");
      int dimRawVal = frame.data[0];
      */
      break;
    }
    //Rückspiegel und dessen Lichtsensorik
    case SPIEGEL_ABBLEND_ADDR:
    {
      break;
    }

    //iDrive Controller

    //iDrive Controller: Drehung
    case IDRIVE_CTRL_ROT_ADDR:
    {
      onIdriveRotaryMovement(frame);
      break;
    } //END ROTARY

      //Knöpfe und Joystick
    case IDRIVE_CTRL_BTN_ADDR:
    {
      onIdriveButtonPressed(frame);
      break;
    }

    //PDC 1
    case PDC_ABSTANDSMELDUNG_1_ADDR:
    {
      /*       //Byte 0~3 = Hinten
      //Byte 4~7 = Vorne
      //Angaben in cm von 0 - 255
      //Heck:
      int backOuterLeft = frame.data[0];
      int backInnerLeft = frame.data[1];
      int backInnerRight = frame.data[2];
      int backOuterRight = frame.data[3];
      //Front:
      int frontOuterLeft = frame.data[4];
      int frontInnerLeft = frame.data[5];
      int frontInnerRight = frame.data[6];
      int frontOuterRight = frame.data[7];
 */
      break;
    }
    //Rückwärtsgang
    case LM_REVERSESTATUS_ADDR:
    {
      if (frame.data[0] == 0xFD)
      {
        //Rückwärtsgang NICHT aktiv
      }
      if (frame.data[0] == 0xFE)
      {
        //Rückwärtsgang AKTIV
      }
      break;
    }
    //Batteriespannung und Status
    case DMEDDE_POWERMGMT_BATTERY_ADDR:
    {
      //(((Byte[1]-240 )*256)+Byte[0])/68
      //float batteryVoltage = (((frame.data[1] - 240) * 256) + frame.data[0]) / 68;

      if (frame.data[3] == 0x00)
      {
        //Zeitstempel
        Serial.print(timeStamp + '\t');
        Serial.println("Engine RUNNING");
      }
      if (frame.data[3] == 0x09)
      {
        //Zeitstempel
        Serial.print(timeStamp + '\t');
        Serial.println("Engine OFF");
      }
      break;
    }
    //Uhrzeit
    case KOMBI_DATETIME_ADDR:
    {
      //Merken, wann das letzte mal diese Nachricht empfangen wurde.
      previousCanDateTime = millis();

      //0: Stunden
      hours = frame.data[0];
      //1: Minuten
      minutes = frame.data[1];
      //2: Sekunden
      seconds = frame.data[2];
      //3: Tage
      days = frame.data[3];
      //4: die ersten 4 bits stellen den Monat dar.
      month = frame.data[4] >> 4;
      //6 & 5: Jahr
      // #6 nach links shiften und 5 addieren
      year = (frame.data[6] << 8) + frame.data[5];

      buildtimeStamp();

      break;
    }
    default:
      break;
    }
  }

  //Timeout für Canbus.
  if (currentMillis - previousCanMsgTimestamp >= CAN_TIMEOUT && canbusEnabled == true)
  {
    //Canbus wurde heruntergefahren. Es werden keinerlei Nachrichten mehr seit 30 Sekunden ausgetauscht.
    //Der iDrive Controller ist jetzt als deaktiviert zu betrachten und muss neu intialisiert werden
    iDriveInitSuccess = false;
    canbusEnabled = false;
    //Zeitstempel
    Serial.print(timeStamp + '\t');
    Serial.println("[checkCan] Keine Nachrichten seit 30 Sekunden. Der Bus wird nun als deaktiviert betrachtet.");
    //enterPowerSaving();
  }
}

void enterPowerSaving()
{
  Serial.println("[Power] Entering power saving...");
  bleKeyboard.end();
  btStop();
  setCpuFrequencyMhz(10);
  if (odroidRunning == HIGH && !anyPendingActions())
  {
    stopOdroid();
  }
  hibernateActive = true;  
}

void exitPowerSaving()
{
  Serial.println("[Power] Exiting power saving mode...");
  if (!btStarted())
  {
    btStart();
    bleKeyboard.begin();
  }
  setCpuFrequencyMhz(240);
  hibernateActive = false;
}

void checkPins()
{
  //Staus Odroid Vcc pin
  odroidRunning = !digitalRead(PIN_ODROID_POWER_INPUT);

  //Status Debug-Pin
  debugMode = !digitalRead(PIN_DEBUG);

  //Prüfe alle Faktoren für Start, Stopp oder Pause des Odroid.
  checkIgnitionState();

