Neuroquila-n8fall/odroid-carpc-esp32/src/main.cpp
  if(false)
  {
    Serial.print("[GPIO] Odroid: ");
    Serial.println(odroidRunning == 1 ? "Running" : "Stopped");
    Serial.print("[CAN] Ignition: ");
    Serial.println(ignitionOn == 0 ? "Running" : "Stopped");
  }
}

void checkIgnitionState()
{
  //Wenn der Status der Zündung sich verändert hat.
  if (ignitionOn != lastIgnitionState)
  {
    //Zündung ist an aber PC ist aus.
    if (ignitionOn == LOW && odroidRunning == LOW)
    {
      //PC starten.
      startOdroid();
    }
  }
  //Letzten Status merken.
  lastIgnitionState = ignitionOn;
}

void startOdroid()
{
  //Zeitstempel
  Serial.print(timeStamp + '\t');
  Serial.print("[startOdroid] Odroid Status:");
  Serial.println(odroidRunning == LOW ? "AUS" : "AN");
  //Mehrfachen Aufruf verhindern - auch wenn der PC bereits läuft
  if (odroidStartRequested || odroidRunning || pendingAction != NONE)
  {
    return;
  }

  //Starten
  odroidStartRequested = true;
  pendingAction = ODROID_START;
  digitalWrite(PIN_ODROID_POWER_BUTTON, HIGH);
  //Zeitstempel
  Serial.print(timeStamp + '\t');
  Serial.println("[startOdroid] Start angefordert.");
  previousOdroidActionTime = millis();
}

void pauseOdroid()
{
  //Wenn der PC aus ist, dann brauchen wir auch nicht Pause drücken.... Wir gehen auch einfach mal davon aus, dass er aus ist.
  //Wenn auch noch eine Stand-By Anforderung ausstehend ist, könnte ein erneutes Drücken den Start wieder auslösen.
  if (odroidPauseRequested || !odroidRunning || pendingAction != NONE)
  {
    return;
  }
  pendingAction = ODROID_STANDBY;
  digitalWrite(PIN_ODROID_DISPLAY_POWER_BUTTON, HIGH);
  digitalWrite(PIN_ODROID_POWER_BUTTON, HIGH);
  Serial.println("[pauseOdroid] Stand-By angefordert");
  //Kurze Verzögerung - kurzer Tastendruck für display und Odroid
  delay(ODROID_STANDBY_HOLD_DELAY);
  digitalWrite(PIN_ODROID_DISPLAY_POWER_BUTTON, LOW);
  digitalWrite(PIN_ODROID_POWER_BUTTON, LOW);
  odroidPauseRequested = true;
  previousOdroidPauseTime = millis();
}

void stopOdroid()
{
  //Zeitstempel
  Serial.print(timeStamp + '\t');
  Serial.print("[stopOdroid] Odroid Status:");
  Serial.println(odroidRunning == LOW ? "AUS" : "AN");
  //Mehrfachen Aufruf verhindern - auch wenn der PC bereits aus ist. Das würde diesen nämlich einschalten.
  if (odroidShutdownRequested || !odroidRunning || pendingAction != NONE)
  {
    return;
  }

  //Herunterfahren
  odroidShutdownRequested = true;
  pendingAction = ODROID_STOP;

  digitalWrite(PIN_ODROID_POWER_BUTTON, HIGH);
  Serial.println("[stopOdroid] Herunterfahren angefordert");

  previousOdroidActionTime = millis();
}

void buildtimeStamp()
{
  sprintf(timeStamp, "%02d:%02d:%02d %02d.%02d.%u", hours, minutes, seconds, days, month, year);
  sprintf(timeString, "%02d:%02d:%02d", hours, minutes, seconds);
  sprintf(dateString, "%02d.%02d.%u", days, month, year);
}

void printCanMsg(int canId, unsigned char *buffer, int len)
{
  //OUTPUT:
  //ABC FF  FF  FF  FF  FF  FF  FF  FF
  Serial.print('[');
  Serial.print(canId, HEX);
  Serial.print(']');
  Serial.print('\t');
  for (int i = 0; i < len; i++)
  {
    Serial.print(buffer[i], HEX);
    Serial.print("\t");
  }
  Serial.println();
}

void printCanMsgCsv(int canId, uint8_t *buffer, int len)
{
  //OUTPUT:
  //ABC FF  FF  FF  FF  FF  FF  FF  FF
  Serial.print(canId, HEX);
  Serial.print(';');
  Serial.print(len);
  Serial.print(';');
  for (int i = 0; i < len; i++)
  {
    Serial.print(buffer[i], HEX);
    //Semikolon nicht beim letzten Eintrag anhängen
    if (i < len - 1)
    {
      Serial.print(';');
    }
  }
  Serial.println();
}

void timeKeeper()
{
  unsigned long currentMillis = millis();
  //Nur, wenn die letzte Aktualisierung über CAN mehr als eine Sekunde zurückliegt
  if (currentMillis - previousCanDateTime > 1000)
  {
    if (hours == 23 && minutes == 59 && seconds == 59)
    {
      hours = 0;
      minutes = 0;
      seconds = 0;
    }
    if (minutes == 59 && seconds == 59)
    {
      hours++;
      minutes = 0;
      seconds = 0;
    }
    if (seconds == 59)
    {
      minutes++;
      seconds = 0;
      buildtimeStamp();
      //Tick abgeschlossen
      return;
    }
    buildtimeStamp();
    //Sekunden erhöhen
    seconds++;
  }
}

void readConsole()
{
  if (Serial.available() > 0)
  {
    String command = Serial.readStringUntil('\n');
    if (command == "pc.stop")
    {
      stopOdroid();
    }
    if (command == "pc.start")
    {
      startOdroid();
    }
    if (command == "pc.pause")
    {
      pauseOdroid();
    }
    if (command == "car.testcan")
    {
    }
  }
}

bool sendMessage(int address, byte len, const uint8_t *buf)
{
  CAN_frame_t frameToSend;
  frameToSend.MsgID = address;
  frameToSend.FIR.B.DLC = len;
  frameToSend.FIR.B.FF = CAN_frame_std;

  //Buffer in data kopieren.
  byte i = len;
  while (i--)
    *(frameToSend.data.u8 + i) = *(buf + i);

  return ESP32Can.CANWriteFrame(&frameToSend) == 1;
}

bool setupCan()
{
  /* set CAN pins and baudrate */
  CAN_cfg.speed = CAN_SPEED_100KBPS;
  CAN_cfg.tx_pin_id = GPIO_NUM_25;
  CAN_cfg.rx_pin_id = GPIO_NUM_26;
  /* create a queue for CAN receiving */
  CAN_cfg.rx_queue = xQueueCreate(10, sizeof(CAN_frame_t));
  // initialize CAN Module
  int errorCode = ESP32Can.CANInit();

  previousCanMsgTimestamp = millis();

  return errorCode == 0;
}

void checkVoltage()
{
  float busvoltage = ina219.getBusVoltage_V();
  voltageReadings[voltageReadingCounter] = busvoltage;
  if (voltageReadingCounter == maxAverageReadings - 1)
  {
    voltageReadingCounter = 0;
  }
  else
  {
    voltageReadingCounter++;
  }

  float totalReadingsValue = 0.0F;
  for (int i = 0; i < maxAverageReadings; i++)
  {
    totalReadingsValue += voltageReadings[i];
  }

  float averageVoltageReading = totalReadingsValue / maxAverageReadings;

  if(true)
  {
    Serial.print("[Voltage] V: ");
    Serial.println(busvoltage);
    Serial.print("[Voltage] Avg: ");
    Serial.println(averageVoltageReading);
  }

  if (averageVoltageReading < 12.10F && odroidRunning == HIGH && !anyPendingActions())
  {
    stopOdroid();
  }
}

void onMflButtonPressed(CANMessage frame)
{
  //Kein Knopf gedrückt (alle 1000ms)
  if (frame.data[0] == 0xC0 && frame.data[1] == 0x0C)
  {
    //Taste wurde losgelassen und zuvor nicht lang genug gedrückt gehalten.
    if (mflButtonCounter < mflButtonHoldThreshold)
    {
      //NEXT oder PREV
      if (MflButtonNextPressed)
      {
        Serial.println("[MFL] NEXT");
        bleKeyboard.press(KEY_MEDIA_NEXT_TRACK);
        bleKeyboard.releaseAll();
      }
      if (MflButtonPrevPressed)
      {
        Serial.println("[MFL] PREV");
        bleKeyboard.press(KEY_MEDIA_PREVIOUS_TRACK);
        bleKeyboard.releaseAll();
      }
    }
    //Knöpfe zurücksetzen
    MflButtonNextPressed = false;
    MflButtonPrevPressed = false;
    //Zeitstempel merken
    lastMflRelease = currentMillis;
    //Counter zurücksetzen
    mflButtonCounter = 0;
  }

  //Wenn innerhalb einer Zeitspanne das selbe Tastensignal gesendet wird, wird der Knopf als gehalten betrachtet, aber nur wenn der Schwellwert erreicht wurde
  //Erneuter Tastendruck innerhalb von Zeit
  if (currentMillis - lastMflPress <= 200)
  {
    mflButtonCounter++;
    //Wenn der Knopf seit bestimmter Zeit nicht gelöst wurde und der Schwellwert erreicht wurde
    if (currentMillis - lastMflRelease >= mflButtonHoldTime && mflButtonCounter > mflButtonHoldThreshold)
    {
      //FASTFORWARD oder REWIND
      //Next
      if (frame.data[0] == 0xE0 && frame.data[1] == 0x0C)
      {
        Serial.println("[MFL] FASTFORWARD");
        bleKeyboard.press(KEY_MEDIA_TRACK_FASTFORWARD);
        bleKeyboard.releaseAll();
      }
      //Prev
      if (frame.data[0] == 0xD0 && frame.data[1] == 0x0C)
      {
        Serial.println("[MFL] REWIND");
        bleKeyboard.press(KEY_MEDIA_TRACK_REWIND);
        bleKeyboard.releaseAll();
      }
    }
  }
  //Next
  if (frame.data[0] == 0xE0 && frame.data[1] == 0x0C)
  {
    MflButtonNextPressed = true;
  }
  //Prev
  if (frame.data[0] == 0xD0 && frame.data[1] == 0x0C)
  {
    MflButtonPrevPressed = true;
  }

  lastMflPress = currentMillis;

  //Pickup Button
  if (frame.data[0] == 0xC1 && frame.data[1] == 0x0C)
  {
  }
  //Voice Button
  if (frame.data[0] == 0xC0 && frame.data[1] == 0x0D)
  {
  }
}

void onCasMessageReceived(CANMessage frame)
{
  //Wakeup Signal vom CAS --> Alle Steuergeräte aufwecken
  //Wird alle 100ms geschickt
  if (frame.data[0] == 0x45)
  {
    ignitionOn = LOW;
  }
  if (frame.data[0] == 0)
  {
    ignitionOn = HIGH;
  }

  //Wenn der Schlüssel im Fach ist, ist der Wert größer 0x0
  if (frame.data[0] > 0)
  {
    if (!iDriveInitSuccess)
    {
      bool sendResult = sendMessage(IDRIVE_CTRL_INIT_ADDR, 8, IDRIVE_CTRL_INIT);
      Serial.print("[KEY-EVENT] Init Controller OK:");
      Serial.println(sendResult);
    }
  }
}

void onIdriveStatusReceived(CANMessage frame)
{
  Serial.println("Controller Init Status Message");
  printCanMsgCsv(frame.rxId, frame.data, frame.len);
  if (frame.data[4] == 6)
  {
    Serial.println("Controller ist nicht initialisiert.");
    //Controller meldet er sei nicht initialisiert: Nachricht zum Initialisieren senden.
    bool sendResult = sendMessage(IDRIVE_CTRL_INIT_ADDR, 8, IDRIVE_CTRL_INIT);
    Serial.print("CAN Send OK:");
    Serial.println(sendResult);
    iDriveInitSuccess = false;
  }
  else
  {
    iDriveInitSuccess = true;
  }
}

