Neuroquila-n8fall/odroid-carpc-esp32/src/main.cpp
void onCasCentralLockingReceived(CANMessage frame)
{
  //Debounce: Befehle werden erst wieder verarbeitet, wenn der Timeout abgelaufen ist.
  if (currentMillis - previousCasMessageTimestamp > CAS_DEBOUNCE_TIMEOUT)
  {
    previousCasMessageTimestamp = currentMillis;
    //Öffnen:     00CF01FF
    if (frame.data[0] == 0x00 && frame.data[1] == 0x30 && frame.data[2] == 0x01 && frame.data[3] == 0x60)
    {
      //Prüfen, ob der PC noch im Begriff ist herunter zu fahren
      if (pendingAction == ODROID_STOP)
      {
        queuedAction = ODROID_START;
        Serial.println("[checkCan] PC wird nach dem Herunterfahren wieder gestartet.");
      }
      //Starten
      startOdroid();

      //Controller initialisieren.
      bool sendResult = sendMessage(IDRIVE_CTRL_INIT_ADDR, 8, IDRIVE_CTRL_INIT);
      Serial.print("Init Controller OK:");
      Serial.println(sendResult);
      previousIdriveInitTimestamp = currentMillis;
      //Zur Kontrolle die Instrumentenbeleuchtung einschalten.
      sendResult = sendMessage(DASHBOARD_LIGHTING_ADDR, 2, DASHBOARD_LIGHTING_ON);
      Serial.print("Light Dashboard OK:");
      Serial.println(sendResult);
      //Displayhelligkeit auf Maximum
      analogWrite(PIN_VU7A_BRIGHTNESS, 255);
    }
    //Schließen:  00DF40FF
    if (frame.data[0] == 0x00 && frame.data[1] == 0x30 && frame.data[2] == 0x04 && frame.data[3] == 0x60)
    {
      //Prüfen, ob der PC noch im Begriff ist hochzufahren
      if (pendingAction == ODROID_START)
      {
        queuedAction = ODROID_STOP;
        Serial.println("[checkCan] PC wird nach dem Starten wieder heruntergefahren.");
      }
      stopOdroid();
      //Displayhelligkeit auf vertretbares Minimum
      analogWrite(PIN_VU7A_BRIGHTNESS, 50);
    }
    //Kofferraum: Wird nur gesendet bei langem Druck auf die Taste
  }
}

void onRainLightSensorReceived(CANMessage frame)
{
  //Pralle Sonne:
  //[314]   50      0       FF
  //Tuch drüber gelegt:
  //[314]   11      8       FF

  //unsigned int lightVal = (frame.data[1] << 8) + frame.data[0];
  //Licht ist definitiv auf byte 0 aber keine Ahnung ob byte 1 noch was zu sagen hat. Dieses byte wechselt jedenfalls nach 8, wenn dann auch das Abblendlicht angeht.

  int lightValue = frame.data[0];

  //Lichtwert prüfen und bei Über- oder Unterschreitungen korrigieren.
  if (lightValue > MAX_LM_LIGHT_LEVEL)
  {
    lightValue = MAX_LM_LIGHT_LEVEL;
  }
  if (lightValue < MIN_LM_LIGHT_LEVEL)
  {
    lightValue = MIN_LM_LIGHT_LEVEL;
  }

  //Display auf volle Helligkeit einstellen. Das ist unser Basiswert
  int val = 255;

  val = map(lightValue, MIN_LM_LIGHT_LEVEL, MAX_LM_LIGHT_LEVEL, MIN_DISPLAY_BRIGHTNESS, MAX_DISPLAY_BRIGHTNESS);
  Serial.print("Licht (Roh, CTRL):\t");
  Serial.print(lightValue);
  Serial.print('\t');
  Serial.print(frame.data[1]);
  Serial.print('\t');
  Serial.println(val);

  //Wenn der aktuelle Wert größer als der zuletzt gespeicherte ist, zählen wir vom letzten Wert hoch.
  if (val > lastBrightness)
  {
    for (int i = lastBrightness; i <= val; i++)
    {
      analogWrite(PIN_VU7A_BRIGHTNESS, i);
      delay(10);
    }
  }

  //Wenn der aktuelle Wert kleiner als der zuletzt gespeicherte ist, dann schrittweise die Helligkeit vom letzten bekannten Wert absenken
  if (val < lastBrightness)
  {
    for (int i = lastBrightness; i >= val; i--)
    {
      analogWrite(PIN_VU7A_BRIGHTNESS, i);
      delay(10);
    }
  }

  //Wenn der Wert unverändert ist zur Sicherheit nochmals letzten Wert schreiben.
  if (val == lastBrightness)
  {
    analogWrite(PIN_VU7A_BRIGHTNESS, val);
    return;
  }

  //letzten Wert zum Vergleich speichern
  lastBrightness = val;
}

void onIdriveRotaryMovement(CANMessage frame)
{
  //Byte 2 beinhaltet den counter
      //Byte 3 Counter Geschwindigkeit der Drehrichtung:
      //        Startet bei 0 bei Drehung im Uhrzeigersinn, wird von 0xFE heruntergezählt bei entgegengesetzter Richtung.
      //Byte 4 0x80 für Drehung im Uhrzeigersinn
      //       0x7F für Drehung gegen den Uhrzeigersinn
      //        Alle anderen Werte: Keine Drehung

      //Code von IAmOrion
      //  https://github.com/IAmOrion/BMW-iDrive-BLE-HID

      //Das System arbeitet nach LittleEndian. Byte 4 und 3 repräsentieren die Drehung und somit auch Drehrichtung.
      /*
      Beispiel:
      E1      FD      AA      FE      7F      1E
      E1      FD      AB      FD      7F      1E
      E1      FD      AC      FE      7F      1E
      E1      FD      AD      FF      7F      1E
      E1      FD      AE      1       80      1E
      E1      FD      AF      2       80      1E
      E1      FD      B0      3       80      1E
      */
      //Es wird also von 80FF nach 7F00 heruntergezählt und umgekehrt.

      byte rotarystepa = frame.data[3];
      byte rotarystepb = frame.data[4];
      //unsigned int newpos = (((unsigned int)rotarystepa) + ((unsigned int)rotarystepb) * 0x100);
      //Bitshift Endianness: 0xFF, 0x7F -> 7FFF
      unsigned int newpos = (rotarystepb << 8) + rotarystepa;

      //Initialstellung des Encoders feststellen
      if (!(RotaryInitPositionSet))
      {
        switch (rotarystepb)
        {
        case 0x7F:
          rotaryposition = (newpos + 1);
          break;
        case 0x80:
          rotaryposition = (newpos - 1);
          break;
        default:
          rotaryposition = newpos;
          break;
        }
        RotaryInitPositionSet = true;
      }

      //Da auch die Drehgeschwindigkeit durch byte 3 mit einbezogen wird, sollte diese auch ausgeführt werden.
      //Hier wird einfach das Delta zwischen alter und neuer Position ausgeführt.
      while (rotaryposition < newpos)
      {
        if (iDriveInitSuccess)
        {
          iDriveRotDir = ROTATION_LEFT;
          //Während der Menüknopf gedrückt ist (bzw. der Joystick gedrückt ist) kann man mit Drehung des Joysticks blättern
          if (iDriveBtnPress == BUTTON_LONG_PRESS && lastKnownIdriveButtonType == IDRIVE_BUTTON_CENTER_MENU)
          {
            //Taste drücken und ALT gedrückt halten, danach Taste wieder loslassen aber ALT gedrückt halten
            bleKeyboard.press(KEY_LEFT_ARROW);
            bleKeyboard.press(KEY_LEFT_ALT);
            bleKeyboard.release(KEY_LEFT_ALT);
          }
          else
          {
            bleKeyboard.press(KEY_DOWN_ARROW);
            bleKeyboard.release(KEY_DOWN_ARROW);
          }
        }
        rotaryposition++;
      }
      while (rotaryposition > newpos)
      {
        if (iDriveInitSuccess)
        {
          iDriveRotDir = ROTATION_RIGHT;
          if (iDriveBtnPress == BUTTON_LONG_PRESS && lastKnownIdriveButtonType == IDRIVE_BUTTON_CENTER_MENU)
          {
            //Taste drücken und ALT gedrückt halten, danach Taste wieder loslassen aber ALT gedrückt halten
            bleKeyboard.press(KEY_RIGHT_ARROW);
            bleKeyboard.press(KEY_LEFT_ALT);
            bleKeyboard.release(KEY_LEFT_ALT);
          }
          else
          {
            bleKeyboard.press(KEY_UP_ARROW);
            bleKeyboard.release(KEY_UP_ARROW);
          }
        }
        rotaryposition--;
      }
      //Zeitstempel
      Serial.print(timeStamp + '\t');
      Serial.print("[checkCan] iDrive Rotation: ");
      switch (iDriveRotDir)
      {
      case ROTATION_LEFT:
      {
        Serial.println("Rechtsdrehung");
        break;
      }
      case ROTATION_RIGHT:
      {
        Serial.println("Linksdrehung");
        break;
      }

      default:
      {
        Serial.println("Keine");
        break;
      }
      } //END ROTARY DIRECTION
}

