Neuroquila-n8fall/odroid-carpc-esp32/src/main.cpp
void onIdriveButtonPressed(CANMessage frame)
{
  //Dieser Wert erhöht sich, wenn eine Taste gedrückt wurde.
      int buttonCounter = frame.data[2];

      //Status der Taste (kurz, lang, losgelassen) oder Joystick-Richtung
      int buttonPressType = frame.data[3];

      //Eingabetyp: Button oder Joystick
      int inputType = frame.data[4];

      //Knopf
      int buttonType = frame.data[5];

      //Entprellung der Knöpfe: Bei jedem Tastendruck wird eine Laufnummer auf byte 2 gesendet. Solange diese sich nicht verändert, wird der Knopf gehalten.
      //Zur Sicherheit wird dabei gleichzeitig die ID des Knopfes selbst abgeglichen.
      if ((buttonCounter != previousIdriveButtonPressCounter || lastKnownIdriveButtonPressType != buttonPressType) && previousIdriveButtonTimestamp - currentMillis >= IDRIVE_BUTTON_DEBOUNCE)
      {
        //Fallunterscheidung nach Art des Knopfdrucks:
        // Kurzer Druck = 1 (Wird dauerhaft gesendet)
        // Gehalten = 2 (Wird nach ca 2 Sekunden halten gesendet)
        // Losgelassen = 0 (wird immer nach dem Loslassen gesendet)
        switch (buttonPressType)
        {
        //Kurzer Knopfdruck registriert
        case 0x01:
        {
          iDriveBtnPress = BUTTON_SHORT_PRESS;
          break;
        }
        //Lang
        case 0x02:
        {
          iDriveBtnPress = BUTTON_LONG_PRESS;
          break;
        }
        } //END BUTONPRESSTYPE
      }
      else
      {
        previousIdriveButtonTimestamp = currentMillis;
        return;
      }

      //Egal wie der vorherige Status war wird beim Senden von "0" die Taste als losgelassen betrachtet.
      if (buttonPressType == 0x00)
      {
        iDriveBtnPress = BUTTON_RELEASE;
        Serial.println("[iDrive] RELEASE");
      }

      //Zeitstempel des letzten Knopfdrucks merken.
      previousIdriveButtonTimestamp = currentMillis;
      //Zuletzt empfangenen Zähler merken.
      previousIdriveButtonPressCounter = buttonCounter;
      //Zuletzt empfangene Bedienungsart merken.
      lastKnownIdriveButtonPressType = buttonPressType;
      //Zuletzt gedrücktne Knopf merken
      lastKnownIdriveButtonType = buttonType;

      //Aussortieren, ob der Knopf in eine Richtung gedrückt wurde oder ob ein Funktionsknopf gedrückt wurde.
      if (inputType != IDRIVE_JOYSTICK)
      {        
        //Knöpfe entsprechend nach Typ behandeln
        switch (buttonType)
        {
        //Joystick oder Menüknopf
        case IDRIVE_BUTTON_CENTER_MENU:
        {
          switch (iDriveBtnPress)
          {
          //Kurz gedrückt
          case BUTTON_SHORT_PRESS:
          {
            bleKeyboard.press(KEY_RETURN);
            break;
          }
          //Lang gedrückt
          case BUTTON_LONG_PRESS:
          {
            //BPMod->keyboardPress(BP_KEY_F11, BP_MOD_NOMOD);
            break;
          }
          //Losgelassen
          case BUTTON_RELEASE:
          {
            bleKeyboard.release(KEY_RETURN);
            break;
          }
          } //END BUTTON PRESS DURATION
          break;
        }
          //BACK Button
        case IDRIVE_BUTTON_BACK:
        {
          switch (iDriveBtnPress)
          {
          //Kurz gedrückt
          case BUTTON_SHORT_PRESS:
          {
            //Zurück
            bleKeyboard.press(KEY_ESC);
            break;
          }
          //Lang gedrückt
          case BUTTON_LONG_PRESS:
            //BPMod->keyboardPress(BP_KEY_F10, BP_MOD_NOMOD);
            break;
          //Losgelassen
          case BUTTON_RELEASE:
          {
            bleKeyboard.release(KEY_ESC);
            break;
          }
          } //END BUTTON PRESS DURATION
          break;
        }
          //OPTION Button
        case IDRIVE_BUTTON_OPTION:
        {
          switch (iDriveBtnPress)
          {
          //Kurz gedrückt
          case BUTTON_SHORT_PRESS:
          {
            //Menü aufrufen
            bleKeyboard.press(KEY_F9);
            break;
          }
          //Lang gedrückt
          case BUTTON_LONG_PRESS:
          {
            //BPMod->keyboardPress(BP_KEY_F11, BP_MOD_NOMOD);
            break;
          }
          //Losgelassen
          case BUTTON_RELEASE:
          {
            bleKeyboard.release(KEY_F9);
            break;
          }
          } //END BUTTON PRESS DURATION
          break;
        }
          //RADIO Button
        case IDRIVE_BUTTON_RADIO:
        {
          switch (iDriveBtnPress)
          {
          //Kurz gedrückt
          case BUTTON_SHORT_PRESS:
          {
            bleKeyboard.press(KEY_F5);
            break;
          }
          //Lang gedrückt
          case BUTTON_LONG_PRESS:
          {
            break;
          }
          //Losgelassen
          case BUTTON_RELEASE:
          {
            bleKeyboard.release(KEY_F5);
            break;
          }

          } //END BUTTON PRESS DURATION
          break;
        }
          //CD Button
        case IDRIVE_BUTTON_CD:
        {
          switch (iDriveBtnPress)
          {
          //Kurz gedrückt
          case BUTTON_SHORT_PRESS:
          {
            bleKeyboard.press(KEY_F6);
            bleKeyboard.release(KEY_F6);
            break;
          }
          //Lang gedrückt
          case BUTTON_LONG_PRESS:
          {
            break;
          }
          //Losgelassen
          case BUTTON_RELEASE:
          {
            break;
          }
          } //END BUTTON PRESS DURATION
          break;
        }
          //NAV Button
        case IDRIVE_BUTTON_NAV:
        {
          switch (iDriveBtnPress)
          {
          //Kurz gedrückt
          case BUTTON_SHORT_PRESS:
          {
            bleKeyboard.press(KEY_F7);
            bleKeyboard.release(KEY_F7);
            break;
          }
          //Lang gedrückt
          case BUTTON_LONG_PRESS:
          {
            break;
          }
          //Losgelassen
          case BUTTON_RELEASE:
          {
            break;
          }
          } //END BUTTON PRESS DURATION
          break;
        }
          //TEL Button
        case IDRIVE_BUTTON_TEL:
        {
          switch (iDriveBtnPress)
          {
          //Kurz gedrückt
          case BUTTON_SHORT_PRESS:
          {
            bleKeyboard.press(KEY_F8);
            bleKeyboard.release(KEY_F8);
            break;
          }
          //Lang gedrückt
          case BUTTON_LONG_PRESS:
          {
            break;
          }
          //Losgelassen
          case BUTTON_RELEASE:
          {
            break;
          }
          } //END BUTTON PRESS DURATION
          break;
        }
        default:
        {
          break;
        } //END BUTTON PRESS
        }
        previousIdriveButton = buttonType;
      }
      else
      {
        switch (buttonPressType)
        {
          //Hoch (kurz)
        case IDRIVE_JOYSTICK_UP:
          bleKeyboard.press(KEY_UP_ARROW);
          bleKeyboard.release(KEY_UP_ARROW);
          break;
          //Hoch (lang)
        case IDRIVE_JOYSTICK_UP_HOLD:
          break;
        //Rechts (kurz)
        case IDRIVE_JOYSTICK_RIGHT:
          bleKeyboard.press(KEY_RIGHT_ARROW);
          bleKeyboard.release(KEY_RIGHT_ARROW);
          break;
        //Rechts (lang)
        case IDRIVE_JOYSTICK_RIGHT_HOLD:
          break;
        //Runter (kurz)
        case IDRIVE_JOYSTICK_DOWN:
          bleKeyboard.press(KEY_DOWN_ARROW);
          bleKeyboard.release(KEY_DOWN_ARROW);
          break;
        //Runter (lang)
        case IDRIVE_JOYSTICK_DOWN_HOLD:
          break;
        //Links (kurz)
        case IDRIVE_JOYSTICK_LEFT:
          bleKeyboard.press(KEY_LEFT_ARROW);
          bleKeyboard.release(KEY_LEFT_ARROW);
          break;
        //Links (lang)
        case IDRIVE_JOYSTICK_LEFT_HOLD:
          break;
        default:
          break;
        } //END DIRECTION
      }
}

bool anyPendingActions()
{
  return odroidStartRequested || odroidShutdownRequested || odroidPauseRequested;
}